app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
SELECT "likes".* FROM "likes" WHERE (idea_id = 5)
---
  def index
    @ideas = Idea.all.sort_by{|idea|idea.likes_number}.reverse

INSERT INTO "ideas" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test3"], ["description", "test description"], ["created_at", "2015-06-04 07:38:30.267012"], ["updated_at", "2015-06-04 07:38:30.267012"]]
---
  def create
    @idea = Idea.new(idea_params)
    if @idea.save

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = NULL LIMIT 1
---
  def show
    if current_user
      @idea = Idea.find(params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @idea = Idea.find(params[:id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "ideas" SET "description" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["description", "This is the description of test 3"], ["updated_at", "2015-06-04 06:46:18.578967"], ["id", 10]]
---
  def update
    @idea = Idea.find(params[:id])
    @idea.update(idea_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 1]]
---
  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy