app/controllers/likes_controller.rb

  def new
    @idea = Idea.find(params[:idea_id])
    @likes = Like.where("idea_id = #{@idea.id}")
    unless previous_like?
      @like = Like.new
      @like.user_id = current_user.id
      @like.idea = @idea
      @like.save
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "likes".* FROM "likes" WHERE (idea_id = 1)
INSERT INTO "likes" ("user_id", "idea_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["idea_id", 9], ["value", 1], ["created_at", "2015-06-03 20:34:07.952846"], ["updated_at", "2015-06-03 20:34:07.952846"]]